zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_hash.h
/** @addtogroup HASH_Exported_Functions_Group3 HMAC processing functions
  * @{
  */
HAL_StatusTypeDef HAL_HASH_HMAC_Start(HASH_HandleTypeDef *hhash, const uint8_t *const pInBuffer, uint32_t Size,
                                      uint8_t  *const pOutBuffer,
                                      uint32_t Timeout);
HAL_StatusTypeDef HAL_HASH_HMAC_Start_DMA(HASH_HandleTypeDef *hhash, const uint8_t *const pInBuffer, uint32_t Size,
                                          uint8_t *const pOutBuffer);
HAL_StatusTypeDef HAL_HASH_HMAC_Start_IT(HASH_HandleTypeDef *hhash, const uint8_t *const pInBuffer, uint32_t Size,
                                         uint8_t *const pOutBuffer);

HAL_StatusTypeDef HAL_HASH_HMAC_Accumulate(HASH_HandleTypeDef *hhash, const uint8_t *const pInBuffer, uint32_t Size,
                                           uint32_t Timeout);
HAL_StatusTypeDef HAL_HASH_HMAC_AccumulateLast(HASH_HandleTypeDef *hhash, const uint8_t *const pInBuffer, uint32_t Size,
                                               uint8_t *const pOutBuffer, uint32_t Timeout);
HAL_StatusTypeDef HAL_HASH_HMAC_Accumulate_IT(HASH_HandleTypeDef *hhash, const uint8_t *const pInBuffer, uint32_t Size);
HAL_StatusTypeDef HAL_HASH_HMAC_AccumulateLast_IT(HASH_HandleTypeDef *hhash, const uint8_t *const pInBuffer,
                                                  uint32_t Size, uint8_t *const pOutBuffer);

/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group4 HASH IRQ handler management
  * @{
  */
void HAL_HASH_IRQHandler(HASH_HandleTypeDef *hhash);
void HAL_HASH_InCpltCallback(HASH_HandleTypeDef *hhash);
void HAL_HASH_DgstCpltCallback(HASH_HandleTypeDef *hhash);
void HAL_HASH_ErrorCallback(HASH_HandleTypeDef *hhash);
HAL_HASH_StateTypeDef HAL_HASH_GetState(const HASH_HandleTypeDef *hhash);
uint32_t HAL_HASH_GetError(const HASH_HandleTypeDef *hhash);

/**
  * @}
  */

/**
  * @}
  */

/* Private macros --------------------------------------------------------*/
/** @defgroup HASH_Private_Macros   HASH Private Macros
  * @{
  */

/**
  * @brief  Return digest length in bytes.
  * @retval Digest length
  */
#define HASH_DIGEST_LENGTH(__HANDLE__) (((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                          == HASH_ALGOSELECTION_SHA1) ?  20U : \
                                         ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                           == HASH_ALGOSELECTION_SHA2_224) ?  28U : \
                                          ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                            == HASH_ALGOSELECTION_SHA2_256) ?  32U : \
                                           ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                             == HASH_ALGOSELECTION_SHA2_384) ?  48U : \
                                            ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                              == HASH_ALGOSELECTION_SHA2_512_224) ?  28U : \
                                             ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                               == HASH_ALGOSELECTION_SHA2_512_256) ?  32U : \
                                              ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                                == HASH_ALGOSELECTION_SHA2_512) ?  64U : \
                                               ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                                 == HASH_ALGOSELECTION_SHA3_224) ?  28U : \
                                                ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                                  == HASH_ALGOSELECTION_SHA3_256) ?  32U : \
                                                 ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                                   == HASH_ALGOSELECTION_SHA3_384) ?  48U : \
                                                  ((READ_BIT((__HANDLE__)->Instance->CR, HASH_CR_ALGO) \
                                                    == HASH_ALGOSELECTION_SHA3_512) ?  64U : \
                                                   ((uint32_t)(__HANDLE__)->Init.DigestOutputLength) ))))))))))))

/**
  * @brief Ensure that HASH input data type is valid.
  * @param __DATATYPE__ HASH input data type.
  * @retval SET (__DATATYPE__ is valid) or RESET (__DATATYPE__ is invalid)
  */
#define IS_HASH_DATATYPE(__DATATYPE__) (((__DATATYPE__) == HASH_NO_SWAP)|| \
                                        ((__DATATYPE__) == HASH_HALFWORD_SWAP)|| \
                                        ((__DATATYPE__) == HASH_BYTE_SWAP) || \
                                        ((__DATATYPE__) == HASH_BIT_SWAP))

/**
  * @brief Ensure that HASH input algorithm is valid.
  * @param __ALGORITHM__ HASH algorithm.
  * @retval SET (__ALGORITHM__ is valid) or RESET (__ALGORITHM__ is invalid)
  */
#define IS_HASH_ALGORITHM(__ALGORITHM__) (((__ALGORITHM__) == HASH_ALGOSELECTION_SHA1)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA2_224)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA2_256)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA2_384)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA2_512_224)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA2_512_256)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA2_512)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA3_224)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA3_256)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA3_384)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHA3_512)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHAKE_128)|| \
                                          ((__ALGORITHM__) == HASH_ALGOSELECTION_SHAKE_256))

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup HASH_Private_Constants HASH Private Constants
  * @{
  */

/**
  * @}
  */
/* Private defines -----------------------------------------------------------*/
/** @defgroup HASH_Private_Defines HASH Private Defines
  * @{
  */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup HASH_Private_Variables HASH Private Variables
  * @{
  */

/**
  * @}
  */
/* Private functions -----------------------------------------------------------*/

/** @addtogroup HASH_Private_Functions HASH Private Functions
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* HASH || HASH1 || HASH2 */
/**
  * @}
  */


#ifdef __cplusplus
}
#endif


#endif /* STM32MP2xx_HAL_HASH_H */
